c6620/multiplier_5_delay_3/run10.txt
# run=10/10
# 2026-04-01T00:38:14-06:00
# cmd: taskset -c 1-55 sysbench oltp_read_write --mysql-db=sbtest --tables=1 --table_size=100 --threads=32 --time=60 --rand-type=pareto run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            749308
        write:                           194705
        other:                           99985
        total:                           1043998
    transactions:                        46463  (774.01 per sec.)
    queries:                             1043998 (17391.64 per sec.)
    ignored errors:                      7059   (117.59 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      774.0129
    time elapsed:                        60.0287s
    total number of events:              46463

Latency (ms):
         min:                                    1.37
         avg:                                   41.33
         max:                                  255.44
         95th percentile:                       86.00
         sum:                              1920313.94

Threads fairness:
    events (avg/stddev):           1451.9688/23.37
    execution time (avg/stddev):   60.0098/0.01